{"data":{"markdownRemark":{"html":"<html>\n<h2>\n    So let me paint the scene for you first:\n</h2>\n<p>   \n    I'm not <i>normally</i> fond of Web development. I'd much prefer write a program in Python or Java or (even C# for that matter) than spend my time mucking around with dozens of different frameworks, convetions, etc.  \n</p>\n<br>\n<p>\n     However; I'm not blind, nor am I stupid. I'm very aware that Web development is the way of the future in this industry and I'd like not to be left behind before I've even gotten a job. I've been meaning to buid myself a\n     personal blog / portfolio for a few months now - but I didn't know where to start.\n</p>\n<br>\n<p>\n\tThe most recent web development I'd done was at ThoughtWorks' LevelUp Build program which used a custom built framework using Handlebars, JEST, and NodeJS. I found it really easy to use and was astounded at how simple some\n\tthings are in web development. Unfortunately, the framework wasn't really designed for creating REAL webpages and more so a cute little webtoy that emulated a not-so-smart smartwatch. (I loved LevelUp though and would totally\n\trecommend it to my Developer friends.) Regardless, I felt I was at a loss for where-to-start again. I decided to ask the ThoughtWorkers and my fellow LevelUp-ers for some advice and they said <i>'Just start from scratch with raw HTML, CSS, and JS.'</i>\n</p>\n<br>\n<h2>\n<i>\n    So that's what I did:\n</i>\n</h2>\n<br>\n<p>\n\tI wrote a very crude site with a header and a footer but I soon realised that I was copy-pasting code all of the place and it never <i>quite</i> looked the way I wanted it too. I felt really frustrated that I hadn't\n\treally progressed since Year 10 IST in terms of Web Development. I could visuallise a nice looking website and I could <i>almost</i> get what I wanted but being a perfectionist - I never felt right posting it. If I\n\twas going to make it in the software industry - I was going to have to work this out.\n</p>\n<br>\n<h2>\n<i>\n    'and then the lightbulb went \"dink\"':\n</i>\n</h2>\n<br>\n<p>\n\tI was at work one day; think it was a Wednesday, and we weren't very busy so I was checking my phone when a LinkedIn notification came up. A mentor from a bit of work experience I did; Ben, had posted about his personal \n\texperience moving his blog to something called GatsbyJS. The post went onto explain what he'd done previous, what GatsbyJS was, and why he switched. This sounded perfect for my use and planned to look into it when I \n\tcame back to my Website project.\n</p>\n<br>\n<h2>\n<i>\n    So what is GatsbyJS?\n</i>\n</h2>\n<br>\n<p>\n\tGatsbyJS is a Static Site Generator. From my understanding; GatsbyJS lets you right React based elements and populate them with GraphQL; a query language like SQL, and then it compiles them all down into static HTML \n\tfiles. While I don't believe I'm qualified to comment on the benefits and drawbacks of such a setup; click <a href = \"https://hbish.com/version-7-gatsbyjs/\">here</a> to read Ben's post if you want read about that. \n\t\n</p>\n<br>\n<p>\n\tHowever I feel I can provide a different perscpective; as a complete noob at Web Code, my expeirence with GatsbyJS must've been pleasant enough for me to actually have published my site with it, right?\n</p>\n<br>\n<p>\n\tOne word answer - YES. GatsbyJS; while a little complicated at first, did really simplify what I wanted to be so when I was writing stuff from scratch. Here's a bunch of things I loved and hated about my first experience with GatsbyJS.\n</p>\n<br>\n<ul \n\tstyle = \"list-style-position: inside; width: fit-content;\">\n\t<p> Loved: </p>\n\t\t<li> \n\t\tReact based components:  I've never worked with React <i> itself </i> but I've heard about it and now I see why it's so popular. GatsbyJS is based on React and so you can get the functionality of React without the full hassle of setting it up. Definitely scores points for being easy to use.\n\t\t</li>\n\t\t<br>\n\t\t<li> \n\t\tDeployment Options: GatsbyJS is great because it literally spits out raw HTMl which means you can host it practically anywhere. No need to install it onto a WordPress server; which also means not having to pay for one because you can post this to GitHub Pages for free.\n\t\t</li>\n\t\t<br>\n\t\t<li> \n\t\tPLUGINS: It has so many plugins and great community behind it. Things are really simple and easy to install - no harder than a node package. Things just work.\n\t\t</li>\n</ul>\n<br>\n<Subble stylingClass = \"\">\n<ul \n\tstyle = \"list-style-position: inside; width: fit-content;\">\n\t<p> Loved: </p>\n\t\t<li> \n\t\tReact based components:  I've never worked with React <i> itself </i> but I've heard about it and now I see why it's so popular. GatsbyJS is based on React and so you can get the functionality of React without the full hassle of setting it up. Definitely scores points for being easy to use.\n\t\t</li>\n\t\t<br>\n\t\t<li> \n\t\tDeployment Options: GatsbyJS is great because it literally spits out raw HTMl which means you can host it practically anywhere. No need to install it onto a WordPress server; which also means not having to pay for one because you can post this to GitHub Pages for free.\n\t\t</li>\n\t\t<br>\n\t\t<li> \n\t\tPLUGINS: It has so many plugins and great community behind it. Things are really simple and easy to install - no harder than a node package. Things just work.\n\t\t</li>\n</ul>\n</html>","frontmatter":{"title":"GatsbyJS:","date":"01-11-2018"}}},"pageContext":{"slug":"/GatsbyJS and Web development/"}}